Blaze_Meter-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: Blaze Meter-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: Blaze Meter-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  Blaze Meter-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1920,911)
      - go(https://blazedemo.com/)
    - label: Find Flights
      actions:
      - clickByXPath(//*[contains(text(), "Paris")])
      - clickByName(fromPort)
      - selectByName(fromPort): "Portland"
      - clickByName(toPort)
      - selectByName(toPort): "Rome"
      - clickByXPath(//input[@value = "Find Flights"])
    - label: Choose a flight
      actions:
      - clickByXPath((//input[@value = "Choose This Flight"])[3])
    - label: Purchase a flight
      actions:
      - clickByXPath(//input[@id=string(//label[text() = "Name"])])
      - typeByXPath(//input[@id=string(//label[text() = "Name"])]): "Genevie Chavez"
      - typeByXPath(//input[@id=string(//label[text() = "Address"])]): "Tondo"
      - typeByXPath(//input[@id=string(//label[text() = "City"])]): "Manila"
      - typeByXPath(//input[@id=string(//label[text() = "State"])]): "PH"
      - typeByXPath(//input[@id=string(//label[text() = "Zip Code"])]): "1012"
      - typeByXPath(//input[@id=string(//label[text() = "Credit Card Number"])]): "34234546546547"
      - clickByXPath(//input[@id=string(//label[text() = "Year"])])
      - clickByXPath(//input[@id=string(//label[text() = "Year"])])
      - doubleClickByXPath(//input[@id=string(//label[text() = "Year"])])
      - typeByXPath(//input[@id=string(//label[text() = "Year"])]): "2024"
      - clickByXPath(//input[@id=string(//label[text() = "Name on Card"])])
      - typeByXPath(//input[@id=string(//label[text() = "Name on Card"])]): "Ghen"
      - clickByXPath(//input[@id=string(//label[text() = "Remember me"])])
      - clickByXPath(//input[@value = "Purchase Flight"])

  Blaze Meter-Http:
    headers:
      sec-ch-ua: '"Not/A)Brand";v="8", "Chromium";v="126", "Google Chrome";v="126"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Upgrade-Insecure-Requests: '1'
      Content-Type: application/x-www-form-urlencoded
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/126.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
    requests:
      - transaction: Find Flights
        force-parent-sample: false
        do:
          - url: 'https://blazedemo.com/reserve.php'
            method: POST
            label: 'https://blazedemo.com/reserve.php'
            think-time: 0ms
            headers: {}
            body:
              fromPort: Portland
              toPort: Rome
          - url: 'https://blazedemo.com/reserve.php'
            method: POST
            label: 'https://blazedemo.com/reserve.php'
            think-time: 2ms
            headers:
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"15.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: >-
                "Not/A)Brand";v="8.0.0.0", "Chromium";v="126.0.6478.127",
                "Google Chrome";v="126.0.6478.127"
            body:
              fromPort: Portland
              toPort: Rome
      - transaction: Choose a flight
        force-parent-sample: false
        do:
          - url: 'https://blazedemo.com/purchase.php'
            method: POST
            label: 'https://blazedemo.com/purchase.php'
            think-time: 15382ms
            headers: {}
            body:
              airline: Aer Lingus
              flight: '9696'
              fromPort: Portland
              price: '200.98'
              toPort: Rome
          - url: 'https://blazedemo.com/purchase.php'
            method: POST
            label: 'https://blazedemo.com/purchase.php'
            think-time: 2ms
            headers:
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"15.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: >-
                "Not/A)Brand";v="8.0.0.0", "Chromium";v="126.0.6478.127",
                "Google Chrome";v="126.0.6478.127"
            body:
              airline: Aer Lingus
              flight: '9696'
              fromPort: Portland
              price: '200.98'
              toPort: Rome
      - transaction: Purchase a flight
        force-parent-sample: false
        do:
          - url: 'https://blazedemo.com/confirmation.php'
            method: POST
            label: 'https://blazedemo.com/confirmation.php'
            think-time: 51727ms
            headers: {}
            body:
              _token: ''
              address: Tondo
              cardType: visa
              city: Manila
              creditCardMonth: '11'
              creditCardNumber: '34234546546547'
              creditCardYear: '2024'
              inputName: Genevie Chavez
              nameOnCard: Ghen
              rememberMe: 'on'
              state: PH
              zipCode: '1012'
          - url: 'https://blazedemo.com/confirmation.php'
            method: POST
            label: 'https://blazedemo.com/confirmation.php'
            think-time: 3ms
            headers:
              sec-ch-ua-arch: '"x86"'
              sec-ch-ua-platform-version: '"15.0.0"'
              sec-ch-ua-model: '""'
              sec-ch-ua-bitness: '"64"'
              sec-ch-ua-wow64: '?0'
              sec-ch-ua-full-version-list: >-
                "Not/A)Brand";v="8.0.0.0", "Chromium";v="126.0.6478.127",
                "Google Chrome";v="126.0.6478.127"
            body:
              _token: ''
              address: Tondo
              cardType: visa
              city: Manila
              creditCardMonth: '11'
              creditCardNumber: '34234546546547'
              creditCardYear: '2024'
              inputName: Genevie Chavez
              nameOnCard: Ghen
              rememberMe: 'on'
              state: PH
              zipCode: '1012'